---
kind: method
id: M:Autodesk.Revit.DB.IntersectionResultArray.Append(Autodesk.Revit.DB.IntersectionResult)
source: html/75ef5f70-9782-0947-22f3-e06023aff88a.htm
---
# Autodesk.Revit.DB.IntersectionResultArray.Append Method

## Syntax (C#)
```csharp
public virtual void Append(
	IntersectionResult item
)
```

## Parameters
- **item** (`Autodesk.Revit.DB.IntersectionResult`)